In [3]:
import pandas as pd

In [21]:
employees = pd.DataFrame({
    "EmpID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"],
    "DeptID": [10, 20, 30]
})

In [23]:
employees

   EmpID     Name  DeptID
0      1    Alice      10
1      2      Bob      20
2      3  Charlie      30

In [ ]:
departments = pd.DataFrame({
    "DeptID": [10, 20, 40],
    "DeptName": ["HR", "Engineering", "Marketing"]
})

In [25]:
departments

   DeptID     DeptName
0      10           HR
1      20  Engineering
2      40    Marketing

Merge Like SQL: pd.merge()

In [8]:
#Inner Join (default)
pd.merge(employees,departments,on="DeptID")

   EmpID   Name  DeptID     DeptName
0      1  Alice      10           HR
1      2    Bob      20  Engineering

In [10]:
#Keeps all employees, fills NaN where no match.
pd.merge(employees, departments, on="DeptID", how="left")#Left Join means I want all rows which is in the left in this case employee is in the left

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      30          NaN

In [12]:
#Keeps all departments, even if no employee.
pd.merge(employees, departments, on="DeptID", how="right")#Right join means I want all rows which is in the right in this case department is in the left

   EmpID   Name  DeptID     DeptName
0    1.0  Alice      10           HR
1    2.0    Bob      20  Engineering
2    NaN    NaN      40    Marketing

In [14]:
#Includes all data, fills missing with NaN.
pd.merge(employees, departments, on="DeptID", how="outer")#Outer join means I want all of the table rows if there have any nan value put it as nan but I want all table

   EmpID     Name  DeptID     DeptName
0    1.0    Alice      10           HR
1    2.0      Bob      20  Engineering
2    3.0  Charlie      30          NaN
3    NaN      NaN      40    Marketing

Concatenating DataFrames

In [37]:
#Vertical (rows)
df1=pd.DataFrame({"Name":["Alice","Bob"],"Score":[423,634]})
df2=pd.DataFrame({"Name":["Charlie","David"],"Age":[45,78]})

In [39]:
df1

    Name  Score
0  Alice    423
1    Bob    634

In [41]:
df2

      Name  Age
0  Charlie   45
1    David   78

In [43]:
pd.concat([df1,df2]) #Vertically

      Name  Score   Age
0    Alice  423.0   NaN
1      Bob  634.0   NaN
0  Charlie    NaN  45.0
1    David    NaN  78.0

In [45]:
pd.concat([df1,df2],axis=1)#Horizontal (columns)

    Name  Score     Name  Age
0  Alice    423  Charlie   45
1    Bob    634    David   78